app/Controllers/UserController.php

                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];

            $user = $this->model->insert($data);
---
INSERT INTO `users` (`username`, `password`, `created_at`, `updated_at`) VALUES ('rendi', '$2y$10$FR.eQ/2ilJsbA95PzDskQOyQhaRreE9Y6DspDZRWNeI0aYKuZXmO2', '2022-10-07 09:56:17', '2022-10-07 09:56:17')

                    'password' => password_hash($input['password'], PASSWORD_DEFAULT)
                ];

                $user = $this->model->update($id, $data);
---
UPDATE `users` SET `username` = 'asdas', `password` = '$2y$10$oM105hXr/DqS2rmAjMyqO.EMU5rEVc1WDp/bICB65s.xsdBcz5K1W', `updated_at` = '2022-10-08 00:01:42'
WHERE `users`.`id` IN ('2')

    public function delete($id = null)
    {
        $user = $this->model->find($id);
        if ($user) {
            $this->model->delete($id);
---
DELETE FROM `users`
WHERE `id` IN ('2')
UPDATE `users` SET `deleted_at` = '2022-10-08 00:03:56', `updated_at` = '2022-10-08 00:03:56'
WHERE `id` IN ('4')
AND `deleted_at` IS NULL

    public function restore($id = null)
    {

        $user = $this->model->onlyDeleted()->find($id);
        if ($user) {
            // $this->model->protect(false)->restore($id);
            $this->model->update($id, ['deleted_at' => null]);
---
UPDATE `users` SET `deleted_at` = NULL, `updated_at` = '2022-10-08 00:12:59'
WHERE `users`.`id` IN ('4')